
 <!DOCTYPE HTML>
<html >
<head>
  <meta charset="UTF-8">
  
    <title>（转）LESS模块化 | Kevin&#39;s Coffee</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="Kevin Hu">
    

    
    <meta name="description" content="less支持模块化，你可以@import ‘xxx.less’的形式导入其他less文件（模块），方便模块化。最近因为研究Css模块化的东西，查询了许多的有关模块化的资料，也确实有所收获，今天我就来介绍一下我了解的Css模块化开发方式吧。
其实，CSS规范里面就已经提到模块化相关内容了，就是@import语法。这个语法是被当前主流浏览器（当然包括ie6）原生支持的。具体怎么用我就不再多介绍了，属于">
<meta property="og:type" content="article">
<meta property="og:title" content="（转）LESS模块化">
<meta property="og:url" content="http://yoursite.com/2016/02/21/LESS模块化/index.html">
<meta property="og:site_name" content="Kevin's Coffee">
<meta property="og:description" content="less支持模块化，你可以@import ‘xxx.less’的形式导入其他less文件（模块），方便模块化。最近因为研究Css模块化的东西，查询了许多的有关模块化的资料，也确实有所收获，今天我就来介绍一下我了解的Css模块化开发方式吧。
其实，CSS规范里面就已经提到模块化相关内容了，就是@import语法。这个语法是被当前主流浏览器（当然包括ie6）原生支持的。具体怎么用我就不再多介绍了，属于">
<meta property="og:updated_time" content="2017-02-04T02:01:49.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="（转）LESS模块化">
<meta name="twitter:description" content="less支持模块化，你可以@import ‘xxx.less’的形式导入其他less文件（模块），方便模块化。最近因为研究Css模块化的东西，查询了许多的有关模块化的资料，也确实有所收获，今天我就来介绍一下我了解的Css模块化开发方式吧。
其实，CSS规范里面就已经提到模块化相关内容了，就是@import语法。这个语法是被当前主流浏览器（当然包括ie6）原生支持的。具体怎么用我就不再多介绍了，属于">

    
    <link rel="alternative" href="/atom.xml" title="Kevin&#39;s Coffee" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/icon.png">
    <link rel="apple-touch-icon-precomposed" href="/img/icon.png">
    
    <link rel="stylesheet" href="/css/style.css">
</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/icon.png" alt="Kevin&#39;s Coffee" title="Kevin&#39;s Coffee"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="Kevin&#39;s Coffee">Kevin&#39;s Coffee</a></h1>
				<h2 class="blog-motto">虚怀若谷，人淡如梅</h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜单">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">首頁</a></li>
					
						<li><a href="/archives">所有文章</a></li>
					
						<li><a href="/about">關於我</a></li>
					
					<li>
 					
					<form class="search" action="//google.com/search" method="get" accept-charset="utf-8">
						<label>Search</label>
						<input type="search" id="search" name="q" autocomplete="off" maxlength="20" placeholder="搜索" />
						<input type="hidden" name="q" value="site:yoursite.com">
					</form>
					
					</li>
				</ul>
			</nav>			
</div>
    </header>
    <div id="container">
      <div id="main" class="post" itemscope itemprop="blogPost">
  
	<article itemprop="articleBody"> 
		<header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/02/21/LESS模块化/" title="（转）LESS模块化" itemprop="url">（转）LESS模块化</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="Kevin Hu" target="_blank" itemprop="author">Kevin Hu</a>
		
  <p class="article-time">
    <time datetime="2016-02-21T08:12:05.000Z" itemprop="datePublished"> 发表于 2016-02-21</time>
    
  </p>
</header>
	<div class="article-content">
		
		<div id="toc" class="toc-article">
			<strong class="toc-title">文章目录</strong>
		
			
		
		</div>
		
		<p>less&#x652F;&#x6301;&#x6A21;&#x5757;&#x5316;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;@import &#x2018;xxx.less&#x2019;&#x7684;&#x5F62;&#x5F0F;&#x5BFC;&#x5165;&#x5176;&#x4ED6;less&#x6587;&#x4EF6;&#xFF08;&#x6A21;&#x5757;&#xFF09;&#xFF0C;&#x65B9;&#x4FBF;&#x6A21;&#x5757;&#x5316;&#x3002;&#x6700;&#x8FD1;&#x56E0;&#x4E3A;&#x7814;&#x7A76;Css&#x6A21;&#x5757;&#x5316;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x67E5;&#x8BE2;&#x4E86;&#x8BB8;&#x591A;&#x7684;&#x6709;&#x5173;&#x6A21;&#x5757;&#x5316;&#x7684;&#x8D44;&#x6599;&#xFF0C;&#x4E5F;&#x786E;&#x5B9E;&#x6709;&#x6240;&#x6536;&#x83B7;&#xFF0C;&#x4ECA;&#x5929;&#x6211;&#x5C31;&#x6765;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;&#x6211;&#x4E86;&#x89E3;&#x7684;Css&#x6A21;&#x5757;&#x5316;&#x5F00;&#x53D1;&#x65B9;&#x5F0F;&#x5427;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#xFF0C;CSS&#x89C4;&#x8303;&#x91CC;&#x9762;&#x5C31;&#x5DF2;&#x7ECF;&#x63D0;&#x5230;&#x6A21;&#x5757;&#x5316;&#x76F8;&#x5173;&#x5185;&#x5BB9;&#x4E86;&#xFF0C;&#x5C31;&#x662F;@import&#x8BED;&#x6CD5;&#x3002;&#x8FD9;&#x4E2A;&#x8BED;&#x6CD5;&#x662F;&#x88AB;&#x5F53;&#x524D;&#x4E3B;&#x6D41;&#x6D4F;&#x89C8;&#x5668;&#xFF08;&#x5F53;&#x7136;&#x5305;&#x62EC;ie6&#xFF09;&#x539F;&#x751F;&#x652F;&#x6301;&#x7684;&#x3002;&#x5177;&#x4F53;&#x600E;&#x4E48;&#x7528;&#x6211;&#x5C31;&#x4E0D;&#x518D;&#x591A;&#x4ECB;&#x7ECD;&#x4E86;&#xFF0C;&#x5C5E;&#x4E8E;Css&#x57FA;&#x7840;&#x6700;&#x57FA;&#x7840;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x4F1A;&#x7684;&#x81EA;&#x884C;&#x8111;&#x8865;&#x4E00;&#x4E0B;&#x5427;&#x3002;&#x4E3A;&#x5565;&#x5927;&#x5BB6;&#x5F88;&#x5C11;&#x7528;&#x5462;&#xFF0C;&#x5927;&#x6982;&#x662F;&#x56E0;&#x4E3A;&#x5728;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x5355;&#x72EC;&#x53BB;&#x7528;@import&#xFF0C;&#x4F1A;&#x6709;&#x8F83;&#x4E3A;&#x4E25;&#x91CD;&#x7684;&#x6027;&#x80FD;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x4E14;&#x4E0D;&#x540C;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x4EE5;&#x53CA;&#x4E0D;&#x540C;&#x7684;&#x7528;&#x6CD5;&#x4E0B;&#x4E5F;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x6BD4;&#x8F83;&#x8BA9;&#x4EBA;&#x90C1;&#x95F7;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x5E76;&#x4E0D;&#x59A8;&#x788D;@import&#x6210;&#x4E3A; CSS&#x6A21;&#x5757;&#x5316; &#x7684;&#x5229;&#x5668;&#x3002;</p>
<a id="more"></a>
<p>&#x4E5F;&#x8BB8;@import&#x8BDE;&#x751F;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;css&#x6A21;&#x5757;&#x5316;&#x7684;&#x95EE;&#x9898;&#x5427;&#x3002;&#x6211;&#x4EEC;&#x5148;&#x6765;&#x4E3E;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x770B;&#x770B;CSS&#x6A21;&#x5757;&#x5316;&#x7684;&#x4F18;&#x52BF;&#xFF1A;</p>
<p>&#x4F20;&#x7EDF;&#x7684;&#x5F00;&#x53D1;</p>
<p>&#x5047;&#x5982;&#x4F60;&#x8981;&#x5F00;&#x53D1;&#x67D0;&#x5927;&#x578B;&#x7F51;&#x7AD9;&#x9996;&#x9875;&#xFF0C;&#x90A3;html&#x7684;head&#x91CC;&#x9762;&#x5E94;&#x8BE5;&#x662F;&#x8FD9;&#x6837;&#x5F15;&#x7528;&#x6837;&#x5F0F;&#x7684;&#xFF1A;</p>
<p>&#x4E3A;&#x4E86;&#x9875;&#x9762;&#x4E0A;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x51CF;&#x5C11;&#x521B;&#x5EFA;http&#x8BF7;&#x6C42;&#x7684;&#x6D88;&#x8017;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x822C;&#x4F1A;&#x9009;&#x62E9;&#x5C3D;&#x91CF;&#x51CF;&#x5C11;link&#x7684;css&#x6587;&#x4EF6;&#x6570;&#x91CF;&#xFF0C;&#x5047;&#x5982;&#x672C;&#x4F8B;&#x4E2D;&#xFF0C;&#x9875;&#x9762;&#x4E0A;&#x6240;&#x6709;&#x7684;&#x6837;&#x5F0F;&#x90FD;&#x5199;&#x5728;&#x4E86;style.css&#x91CC;&#x9762;&#x3002;&#x53EF;&#x60F3;&#x800C;&#x77E5;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x5927;&#x578B;&#x7F51;&#x7AD9;&#x6765;&#x8BB2;&#xFF0C;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x4F1A;&#x6709;&#x591A;&#x957F;&#x3002;&#x5982;&#x679C;&#x51FA;&#x73B0;bug&#x6216;&#x8005;&#x60F3;&#x6539;&#x4E2A;&#x4E1C;&#x897F;&#xFF0C;&#x9700;&#x8981;&#x7684;&#x6210;&#x672C;&#x4F1A;&#x6BD4;&#x8F83;&#x5927;&#xFF1B;&#x800C;&#x4E14;&#x73B0;&#x5728;&#x4E1A;&#x754C;&#x5185;&#x5BF9;&#x4E8E;CSS&#x5F00;&#x53D1;&#x5E76;&#x6CA1;&#x6709;&#x5F88;&#x6210;&#x719F;&#x7684;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x6216;&#x8005;&#x7EA6;&#x5B9A;&#x53EF;&#x5FAA;&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x524D;&#x7AEF;&#x4E3A;&#x4E86;&#x52A0;&#x5FEB;&#x8FDB;&#x5EA6;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x628A;&#x67D0;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x7684;&#x4EE3;&#x7801;&#x653E;&#x5728;css&#x4E0D;&#x540C;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x5982;&#x679C;&#x60F3;&#x53BB;&#x6389;&#x67D0;&#x4E2A;&#x529F;&#x80FD;&#xFF0C;&#x80AF;&#x5B9A;&#x4E0D;&#x6562;&#x8F7B;&#x6613;&#x5220;&#x9664;&#x9875;&#x9762;Css&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x8FD9;&#x65F6;&#x5019;&#xFF0C;CSS&#x6A21;&#x5757;&#x5316;&#x7684;&#x4F18;&#x52BF;&#x5C31;&#x4F53;&#x73B0;&#x51FA;&#x6765;&#x4E86;&#xFF01;</p>
<p>&#x6A21;&#x5757;&#x5316;&#x5F00;&#x53D1;</p>
<p>&#x9875;&#x9762;&#x4E0D;&#x6539;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x662F;&#x53EA;&#x5F15;&#x7528;&#x90A3;&#x4E00;&#x4E2A;&#x6837;&#x5F0F;&#xFF0C;style.css&#xFF0C;&#x4F46;&#x662F;&#x6587;&#x4EF6;&#x5185;&#x5BB9;&#x6539;&#x6210;&#x5982;&#x4E0B;&#x6837;&#x5F0F;&#xFF1A;</p>
<p>/<em>xxx&#x9875;&#x9762;&#x5165;&#x53E3;&#x6837;&#x5F0F;&#x6587;&#x4EF6;style.css</em>/</p>
<p>@import &apos;./css/base.css&apos;;/<em>&#x9875;&#x9762;&#x57FA;&#x7840;&#x6837;&#x5F0F;</em>/</p>
<p>@import &apos;./css/index.css&apos;;</p>
<p>@import &apos;./css/header.css&apos;;</p>
<p>@import &apos;./css/footer.css&apos;;</p>
<p>&#x2026;&#x2026;</p>
<p>&#x4EE5;&#x4E0A;&#x4E3A;&#x591A;&#x4E2A;&#x6A21;&#x5757;&#x7684;&#x6837;&#x5F0F;&#x6587;&#x4EF6;</p>
<p>&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x628A;style.css&#x4E2D;&#x6DF7;&#x4E71;&#x7684;&#x6837;&#x5F0F;&#x5212;&#x5206;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x4E00;&#x4E2A;&#x7684;&#x5B50;&#x6587;&#x4EF6;&#xFF0C;&#x4F5C;&#x4E3A;&#x6A21;&#x5757;&#x3002;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x4F5C;&#x4E3A;&#x793A;&#x4F8B;&#xFF0C;&#x6211;&#x628A;&#x9875;&#x9762;&#x7684;&#x4E00;&#x4E9B;reset&#x6837;&#x5F0F;&#x4EE5;&#x53CA;&#x4E00;&#x4E9B;&#x7AD9;&#x70B9;&#x516C;&#x7528;&#x6837;&#x5F0F;&#x653E;&#x5728;&#x4E86;css&#x76EE;&#x5F55;&#x4E0B;&#x7684;base.css&#x4E2D;&#xFF0C;&#x628A;&#x9875;&#x5934;&#x62C6;&#x5206;&#x6210;header.css&#xFF0C;&#x628A;&#x9875;&#x9762;&#x7684;&#x57FA;&#x7840;&#x5E03;&#x5C40;&#x90FD;&#x653E;&#x5728;&#x4E86;index.css&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x5E95;&#x90E8;&#x7684;&#x6837;&#x5F0F;&#x653E;&#x5728;&#x4E86;footer.css&#x3002;&#x7136;&#x540E;&#x76F8;&#x5E94;&#x7684;&#x4EE3;&#x7801;&#x5C31;&#x5728;&#x5BF9;&#x5E94;&#x7684;&#x6A21;&#x5757;&#x4E2D;&#x5199;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x770B;&#x8D77;&#x6765;&#x7B80;&#x6D01;&#x3001;&#x597D;&#x7EF4;&#x62A4;&#x5F88;&#x591A;&#x5462;&#xFF1F;</p>
<p>&#x4E0D;&#x5149;&#x662F;&#x7B80;&#x6D01;&#xFF0C;&#x4F7F;&#x7528;@import&#x5F62;&#x5F0F;&#x7684;&#x6A21;&#x5757;&#x5316;&#x8FD8;&#x6709;&#x4E0B;&#x5217;&#x597D;&#x5904;&#xFF1A;</p>
<ol>
<li>&#x6D4F;&#x89C8;&#x5668;&#x539F;&#x751F;&#x652F;&#x6301;</li>
</ol>
<p>&#x8FD9;&#x70B9;&#x662F;&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x6216;&#x8005;&#x8FD9;&#x79CD;&#x6A21;&#x5757;&#x5316;&#x5F62;&#x5F0F;&#x7684;&#x4EAE;&#x70B9;&#x3002;&#x5BF9;&#x4E8E;less&#xFF0C;&#x60F3;&#x8981;&#x5728;&#x5F00;&#x53D1;&#x73AF;&#x5883;&#x4E0B;&#x65B9;&#x4FBF;&#x5730;&#x4FEE;&#x6539;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x989D;&#x5916;&#x5F15;&#x5165;&#x4E00;&#x4E2A;js&#x6587;&#x4EF6;&#xFF0C;&#x6216;&#x8005;&#x91C7;&#x53D6; less&#x5B9E;&#x65F6;&#x7F16;&#x8BD1;&#x4E4B;&#x7C7B;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x800C;&#x91C7;&#x7528;&#x8FD9;&#x79CD; @import xxx.css&#x6587;&#x4EF6;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5F88;&#x65B9;&#x4FBF;&#x5730;&#x5728;&#x5F00;&#x53D1;&#x9636;&#x6BB5;&#xFF0C;&#x76F4;&#x63A5;&#x8C03;&#x8BD5;&#x3002;&#x4E0D;&#x9700;&#x8981;&#x5F15;&#x5165;&#x989D;&#x5916;&#x7684;js&#x6587;&#x4EF6;&#x53BB;&#x89E3;&#x6790;style.css&#x6587;&#x4EF6;&#x3002;&#x9875;&#x9762;&#x4E2D;&#x76F4;&#x63A5;&#x5F15;&#x5165;style.css&#x6587;&#x4EF6;&#xFF0C;&#x901A;&#x8FC7;http&#x7011;&#x5E03;&#x56FE;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;base.css&#x3001;index.css&#x7B49;&#x88AB;&#x4E00;&#x4E2A;&#x4E00;&#x4E2A;&#x52A0;&#x8F7D;&#x8FDB;&#x6765;&#x4E86;&#x3002;</p>
<ol start="2">
<li>&#x65B9;&#x4FBF;&#x5220;&#x9664;&#x67D0;&#x4E2A;&#x6A21;&#x5757;</li>
</ol>
<p>&#x8FD9;&#x4E2A;&#x662F;&#x6240;&#x6709;&#x8BED;&#x8A00;&#x6A21;&#x5757;&#x5316;&#x7684;&#x4F18;&#x52BF;&#xFF0C;&#x6BD4;&#x5982;&#x54EA;&#x5929;PD&#x8BF4;&#xFF0C;&#x9996;&#x9875;&#x5E95;&#x90E8;&#x90A3;&#x4E2A;&#x5730;&#x65B9;&#x6211;&#x60F3;&#x6362;&#x4E2A;&#x6837;&#x5F0F;&#xFF0C;&#x4EE5;&#x5F80;&#xFF0C;&#x6211;&#x4EEC;&#x5F88;&#x591A;&#x90FD;&#x662F;&#x76F4;&#x63A5;&#x5728;html&#x91CC;&#x9762;&#x6539;&#x6389;&#x539F; &#x6765;&#x7684;class&#xFF0C;&#x7136;&#x540E;&#x5728;style.css&#x91CC;&#x9762;&#x76F4;&#x63A5;&#x52A0;&#x4E0A;&#x65B0;&#x7684;&#x6837;&#x5F0F;&#xFF0C;&#x8001;&#x7684;&#x4E5F;&#x4E0D;&#x6562;&#x5220;&#xFF0C;&#x6015;&#x5220;&#x9519;&#x4E86;&#xFF0C;&#x5373;&#x4F7F;&#x5220;&#x4E86;&#x4E5F;&#x53EF;&#x80FD;&#x4F1A;&#x6F0F;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0D;&#x505C;&#x7684;bugfix&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x4EE3;&#x7801;&#x4E71;&#x5199;&#x3002;&#x800C;&#x91C7;&#x7528;&#x6A21;&#x5757;&#x5316;&#x7684;&#x65B9;&#x6848;&#xFF0C;&#x6211;&#x76F4;&#x63A5;&#x628A;@import &#x2018;./css/footer.css&#x2019;&#x8FD9;&#x4E00;&#x884C;&#x6CE8;&#x91CA;&#x6389;&#xFF0C;&#x7136;&#x540E;&#x518D;@import&#x65B0;&#x7684;&#x6837;&#x5F0F;&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;&#x5373;&#x4F7F;&#x4E0A;&#x7EBF;&#x4E86;&#xFF0C;PD&#x8BF4;&#x6548;&#x679C;&#x4E0D;&#x597D;&#xFF0C;&#x60F3;&#x6362;&#x56DE;&#x539F;&#x6765;&#x7684;&#xFF0C;&#x53EA;&#x8981;&#x6539;&#x4E00;&#x4E0B;&#x6CE8;&#x91CA;&#xFF0C;&#x91CD;&#x65B0;&#x6253;&#x5305;&#xFF0C;&#x5C82;&#x4E0D;&#x662F;&#x5F88;&#x65B9;&#x4FBF;&#xFF1F;</p>
<ol start="3">
<li>&#x4FBF;&#x4E8E;&#x7BA1;&#x7406;&#x5404;&#x79CD;&#x65E5;&#x5E38;&#x9700;&#x6C42;</li>
</ol>
<p>&#x597D;&#xFF0C;&#x9875;&#x9762;&#x505A;&#x597D;&#x4E86;&#xFF0C;&#x4E0A;&#x7EBF;&#x4E86;&#xFF0C;PD&#x4ECA;&#x5929;&#x8111;&#x888B;&#x62BD;&#x98CE;&#xFF0C;&#x8BF4;&#x6211;&#x8981;&#x52A0;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#xFF0C;&#x9996;&#x9875;&#x53F3;&#x4FA7;&#x52A0;&#x4E00;&#x4E2A;&#x5EFA;&#x8BAE;&#x53CD;&#x9988;&#x5165;&#x53E3;&#xFF0C;&#x4EE5;&#x5F80;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x6253;&#x5F00; style.css&#xFF0C;&#x60F3;&#x60F3;&#x5728;&#x54EA;&#x513F;&#x52A0;&#x597D;&#xFF0C;&#x6216;&#x8005;&#x76F4;&#x63A5;&#x52A0;&#x5728;&#x6700;&#x540E;&#xFF0C;&#x4E5F;&#x4E0D;&#x7BA1;&#x6700;&#x540E;&#x7684;&#x5730;&#x65B9;&#x662F;&#x653E;&#x4EC0;&#x4E48;&#x7684;&#x3002;&#x91C7;&#x7528;&#x6A21;&#x5757;&#x5316;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5728;style.css&#x7684;&#x6700;&#x540E;&#x518D;@import &#x2018;./css/feedback.css&#x2019;&#x5373;&#x53EF;&#xFF0C;&#x7136;&#x540E;&#x52A0;&#x4E0A;&#x6CE8;&#x91CA;&#xFF1A;/* 2012-12-06 PD&#x8981;&#x6C42;&#x52A0;&#x4E0A;&#x5EFA;&#x8BAE;&#x53CD;&#x9988; */&#xFF0C;&#x8FD9;&#x6837;&#x4EE5;&#x540E;&#x5176;&#x4ED6;&#x4FEE;&#x6539;&#x8005;&#x4E5F;&#x80FD;&#x5FEB;&#x901F;&#x77E5;&#x9053;&#x4F60;&#x8FD9;&#x4E2A;&#x6A21;&#x5757;&#x662F;&#x5E72;&#x795E;&#x9A6C;&#x7684;&#x3002;</p>
<ol start="4">
<li>&#x65B9;&#x4FBF;&#x5408;&#x4F5C;&#x5F00;&#x53D1;</li>
</ol>
<p>&#x8FD9;&#x4E5F;&#x662F;&#x6240;&#x6709;&#x8BED;&#x8A00;&#x6A21;&#x5757;&#x5316;&#x7684;&#x4F18;&#x52BF;&#x3002;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x5927;&#x578B;&#x9879;&#x76EE;&#xFF0C;&#x5F80;&#x5F80;&#x5171;&#x540C;&#x5F00;&#x53D1;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x51B2;&#x7A81;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x975E;&#x5E38;&#x5927;&#xFF0C;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x6539;&#x4E86;&#x4E00;&#x4E2A;&#x5C0F;&#x5730;&#x65B9;&#xFF0C;&#x63D0;&#x4EA4;&#x4E0A;&#x53BB;&#x5C31;&#x51B2;&#x7A81;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x82B1;&#x8D39;&#x6BD4;bugfix&#x591A;10&#x500D;&#x7684;&#x65F6;&#x95F4;&#x53BB;&#x89E3;&#x51B3;&#x51B2;&#x7A81;&#xFF0C;&#x7136;&#x540E;&#x8FD8;&#x4E0D;&#x77E5;&#x9053;&#x4F1A;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x53E6;&#x5916;10&#x4E2A;&#x65B0;bug&#xFF0C;&#x800C;&#x6A21;&#x5757;&#x5316;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x8D1F;&#x8D23;&#x54EA;&#x4E9B;&#x6A21;&#x5757;&#xFF0C;&#x804C;&#x8D23;&#x975E;&#x5E38;&#x660E;&#x786E;&#xFF0C;&#x4E0D;&#x5BB9;&#x6613;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x3002;</p>
<ol start="5">
<li>&#x65B9;&#x4FBF;&#x591A;&#x4EBA;&#x534F;&#x4F5C;</li>
</ol>
<p>&#x4F9D;&#x8D56;&#x5199;&#x5728;&#x5165;&#x53E3;&#x6587;&#x4EF6;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6253;&#x5305;&#x811A;&#x672C;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x3002;&#x8FD9;&#x6837;&#x5F00;&#x53D1;&#x548C;&#x6253;&#x5305;&#x5206;&#x79BB;&#xFF0C;&#x65B0;&#x52A0;&#x3001;&#x51CF;&#x5C11;&#x6A21;&#x5757;&#x4E0D;&#x9700;&#x8981;&#x53BB;&#x4FEE;&#x6539;&#x6253;&#x5305;&#x914D;&#x7F6E;&#xFF0C;&#x65B9;&#x4FBF;&#x591A;&#x4EBA;&#x534F;&#x4F5C;&#x3002;</p>
<p>OK&#xFF0C;&#x8BF4;&#x5B8C;CSS&#x6A21;&#x5757;&#x5316;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x5229;&#x7528;@import&#x5F62;&#x5F0F;&#x6765;&#x7EC4;&#x7EC7;&#x81EA;&#x5DF1;&#x7684;&#x6A21;&#x5757;&#xFF0C;&#x5927;&#x5BB6;&#x662F;&#x4E0D;&#x662F;&#x611F;&#x89C9;&#x8FD9;&#x79CD;&#x5F62;&#x5F0F;&#x8BA9;&#x4F60;&#x773C;&#x524D;&#x4E00;&#x4EAE;&#x5462;&#xFF1F;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x6837;&#x5F00;&#x53D1;&#x5B8C;&#x76F4;&#x63A5;&#x4E0A;&#x7EBF;&#x7684;&#x8BDD;&#xFF0C;&#x9875;&#x9762;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#x3002;&#x6211;&#x5C31;&#x6311;&#x4E00;&#x4E9B;&#x6BD4;&#x8F83;&#x660E;&#x663E;&#x7684;&#x95EE;&#x9898;&#x8BF4;&#x4E00;&#x4E0B;&#xFF1A;</p>
<ol>
<li>
<p>&#x56E0;&#x4E3A;@import&#x7684;&#x6587;&#x4EF6;&#x662F;&#x989D;&#x5916;&#x8BF7;&#x6C42;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x9875;&#x9762;&#x52A0;&#x8F7D;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x6709;&#x4E00;&#x5C0F;&#x4F1A;&#x513F;&#x7684;&#x88F8;&#x4F53;&#xFF08;&#x6837;&#x5F0F;&#x6CA1;&#x52A0;&#x8F7D;&#x8FDB;&#x6765;&#xFF09;&#xFF0C;&#x8981;&#x7B49;&#x8FD9;&#x4E9B;&#x6A21;&#x5757;&#x4E00;&#x4E2A;&#x4E00;&#x4E2A;&#x52A0;&#x8F7D;</p>
</li>
<li>
<p>&#x8BF7;&#x6C42;&#x6570;&#x592A;&#x591A;&#xFF0C;&#x9875;&#x9762;&#x6027;&#x80FD;&#x4E0D;&#x4F73;&#xFF0C;&#x5BF9;&#x670D;&#x52A1;&#x5668;&#x538B;&#x529B;&#x4E5F;&#x4F1A;&#x76F8;&#x5BF9;&#x5927;&#x4E00;&#x4E9B;&#x3002;</p>
</li>
<li>
<p>&#x4E0D;&#x540C;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x4EE5;&#x53CA;&#x4E0D;&#x540C;&#x7684;&#x4E66;&#x5199;&#x5F62;&#x5F0F;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x52A0;&#x8F7D;&#x987A;&#x5E8F;&#x3002;</p>
</li>
</ol>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x6700;&#x597D;&#x7684;&#x529E;&#x6CD5;&#x5C31;&#x662F;&#x628A;&#x6A21;&#x5757;&#x6253;&#x5305;&#xFF01;&#x8FD9;&#x548C;js&#x6A21;&#x5757;&#x5316;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x6A21;&#x5757;&#x5316;&#x5F00;&#x53D1;&#xFF0C;&#x7136;&#x540E;&#x4E0A;&#x7EBF;&#x4E4B;&#x524D;&#x6253;&#x5305;&#xFF0C;&#x7EBF;&#x4E0A;&#x5B8C;&#x7F8E;&#x4F7F;&#x7528;&#x3002;</p>
<hr>
<p>&#x6587;&#xFF0F;&#x738B;&#x5B66;&#x5175;&#xFF08;&#x7B80;&#x4E66;&#x4F5C;&#x8005;&#xFF09;
<a href="http://www.jianshu.com/p/d46bc8cf3afa" target="_blank" rel="external">&#x539F;&#x6587;&#x94FE;&#x63A5;</a>
&#x8457;&#x4F5C;&#x6743;&#x5F52;&#x4F5C;&#x8005;&#x6240;&#x6709;&#xFF0C;&#x8F6C;&#x8F7D;&#x8BF7;&#x8054;&#x7CFB;&#x4F5C;&#x8005;&#x83B7;&#x5F97;&#x6388;&#x6743;&#xFF0C;&#x5E76;&#x6807;&#x6CE8;&#x201C;&#x7B80;&#x4E66;&#x4F5C;&#x8005;&#x201D;&#x3002;</p>
  
	</div>
		<footer class="article-footer clearfix">
<div class="article-catetags">


  <div class="article-tags">
  
  <span></span> <a href="/tags/less/">less</a><a href="/tags/模块化/">模块化</a><a href="/tags/gulp/">gulp</a><a href="/tags/前端工程化/">前端工程化</a>
  </div>

</div>



	<div class="article-share" id="share">
	
	  <div data-url="http://yoursite.com/2016/02/21/LESS模块化/" data-title="（转）LESS模块化 | Kevin&#39;s Coffee" data-tsina="null" class="share clearfix">
	  </div>
	
	</div>


</footer>

   	       
	</article>
	
<nav class="article-nav clearfix">
 
 <div class="prev" >
 <a href="/2016/02/22/Jade在前端渲染中的使用/" title="Jade在前端渲染中的使用">
  <strong>上一篇：</strong><br/>
  <span>
  Jade在前端渲染中的使用</span>
</a>
</div>


<div class="next">
<a href="/2016/02/20/模仿拉勾网/"  title="模仿拉勾网">
 <strong>下一篇：</strong><br/> 
 <span>模仿拉勾网
</span>
</a>
</div>

</nav>

	

</div>  
      <div class="openaside"><a class="navbutton" href="#" title="显示侧边栏"></a></div>

  <div id="toc" class="toc-aside">
  <strong class="toc-title">文章目录</strong>
 
 
 
  </div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隐藏侧边栏"></a></div>
<aside class="clearfix">

  
<div class="github-card">
<p class="asidetitle">Github 名片</p>
<div class="github-card" data-github="KevinHu-1024" data-width="220" data-height="119" data-theme="medium">
<script type="text/javascript" src="//cdn.jsdelivr.net/github-cards/latest/widget.js" ></script>
</div>
  </div>



  

  
<div class="tagslist">
	<p class="asidetitle">标签</p>
		<ul class="clearfix">
		
			
				<li><a href="/tags/全栈/" title="全栈">全栈<sup>6</sup></a></li>
			
		
			
				<li><a href="/tags/agui/" title="agui">agui<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/项目总结/" title="项目总结">项目总结<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/angular/" title="angular">angular<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/nodejs/" title="nodejs">nodejs<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/前端工程化/" title="前端工程化">前端工程化<sup>3</sup></a></li>
			
		
			
				<li><a href="/tags/javascript/" title="javascript">javascript<sup>3</sup></a></li>
			
		
			
				<li><a href="/tags/angularJS/" title="angularJS">angularJS<sup>3</sup></a></li>
			
		
			
				<li><a href="/tags/模块化/" title="模块化">模块化<sup>3</sup></a></li>
			
		
			
				<li><a href="/tags/读书笔记/" title="读书笔记">读书笔记<sup>3</sup></a></li>
			
		
			
				<li><a href="/tags/jade/" title="jade">jade<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/前端渲染/" title="前端渲染">前端渲染<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/less/" title="less">less<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/AMD/" title="AMD">AMD<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/requirejs/" title="requirejs">requirejs<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/CMD/" title="CMD">CMD<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/seajs/" title="seajs">seajs<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/commonJS/" title="commonJS">commonJS<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/browserify/" title="browserify">browserify<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/gulp/" title="gulp">gulp<sup>1</sup></a></li>
			
		
		</ul>
</div>


  <div class="linkslist">
  <p class="asidetitle">友情链接</p>
    <ul>
        
          <li>
            
            	<a href="http://wuchong.me" target="_blank" title="Jark&#39;s Blog">Jark&#39;s Blog</a>
            
          </li>
        
    </ul>
</div>

  


  <div class="rsspart">
	<a href="/atom.xml" target="_blank" title="rss">RSS 订阅</a>
</div>

</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	<div class="line">
		<span></span>
		<div class="author"></div>
	</div>
	
	
	<section class="info">
		<p> 折腾即生命 <br/>
			Keep the curiosity to the world, forever.</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		
		<a href="https://github.com/KevinHu-1024" target="_blank" class="icon-github" title="github"></a>
		
		
		<a href="http://stackoverflow.com/users/4244468" target="_blank" class="icon-stack-overflow" title="stackoverflow"></a>
		
		
		
		
		
		
		<a href="http://www.zhihu.com/people/kevinhu-1024" target="_blank" class="icon-zhihu" title="知乎"></a>
		
		
		
		<a href="mailto:kevinhu.1024@gmail.com" target="_blank" class="icon-email" title="Email Me"></a>
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="https://github.com/wuchong/jacman" target="_blank" title="Jacman">Jacman</a> © 2017 
		
		<a href="/about" target="_blank" title="Kevin Hu">Kevin Hu</a>
		
		
		</p>
</div>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>
<script src="/js/jquery.qrcode-0.12.0.min.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
      
      $('#toc.toc-aside').css('display', 'none');
        
    }
  });
});
</script>

<script type="text/javascript">
$(document).ready(function(){ 
  var ai = $('.article-content>iframe'),
      ae = $('.article-content>embed'),
      t  = $('#toc'),
      ta = $('#toc.toc-aside'),
      o  = $('.openaside'),
      c  = $('.closeaside');
  if(ai.length>0){
    ai.wrap('<div class="video-container" />');
  };
  if(ae.length>0){
   ae.wrap('<div class="video-container" />');
  };
  c.click(function(){
    ta.css('display', 'block').addClass('fadeIn');
  });
  o.click(function(){
    ta.css('display', 'none');
  });
  $(window).scroll(function(){
    ta.css("top",Math.max(140,320-$(this).scrollTop()));
  });
});
</script>


<script type="text/javascript">
$(document).ready(function(){ 
  var $this = $('.share'),
      url = $this.attr('data-url'),
      encodedUrl = encodeURIComponent(url),
      title = $this.attr('data-title'),
      tsina = $this.attr('data-tsina'),
      description = $this.attr('description');
  var html = [
  '<div class="hoverqrcode clearfix"></div>',
  '<a class="overlay" id="qrcode"></a>',
  '<a href="https://www.facebook.com/sharer.php?u=' + encodedUrl + '" class="article-share-facebook" target="_blank" title="Facebook"></a>',
  '<a href="https://twitter.com/intent/tweet?url=' + encodedUrl + '" class="article-share-twitter" target="_blank" title="Twitter"></a>',
  '<a href="#qrcode" class="article-share-qrcode" title="微信"></a>',
  '<a href="http://widget.renren.com/dialog/share?resourceUrl=' + encodedUrl + '&srcUrl=' + encodedUrl + '&title=' + title +'" class="article-share-renren" target="_blank" title="人人"></a>',
  '<a href="http://service.weibo.com/share/share.php?title='+title+'&url='+encodedUrl +'&ralateUid='+ tsina +'&searchPic=true&style=number' +'" class="article-share-weibo" target="_blank" title="微博"></a>',
  '<span title="Share to"></span>'
  ].join('');
  $this.append(html);

  $('.hoverqrcode').hide();

  var myWidth = 0;
  function updatehoverqrcode(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
    var qrsize = myWidth > 1024 ? 200:100;
    var options = {render: 'image', size: qrsize, fill: '#2ca6cb', text: url, radius: 0.5, quiet: 1};
    var p = $('.article-share-qrcode').position();
    $('.hoverqrcode').empty().css('width', qrsize).css('height', qrsize)
                          .css('left', p.left-qrsize/2+20).css('top', p.top-qrsize-10)
                          .qrcode(options);
  };
  $(window).resize(function(){
    $('.hoverqrcode').hide();
  });
  $('.article-share-qrcode').click(function(){
    updatehoverqrcode();
    $('.hoverqrcode').toggle();
  });
  $('.article-share-qrcode').hover(function(){}, function(){
      $('.hoverqrcode').hide();
  });
});   
</script>









<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      if (alt) $(this).after('<span class="caption">' + alt + '</span>');
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->



<script>
var _hmt = _hmt || [];
(function() {
  var hm = document.createElement("script");
  hm.src = "//hm.baidu.com/hm.js?325a9a8c3667dacc6d30156da64f6f51";
  var s = document.getElementsByTagName("script")[0]; 
  s.parentNode.insertBefore(hm, s);
})();
</script>



<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="返回顶部"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
</html>
